-- MySQL dump 10.13  Distrib 8.0.19, for osx10.14 (x86_64)
--
-- Host: localhost    Database: lottery
-- ------------------------------------------------------
-- Server version	8.0.19

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `activities`
--

DROP TABLE IF EXISTS `activities`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `activities` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL,
  `code` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL,
  `bz` varchar(256) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `started` datetime DEFAULT NULL,
  `ended` datetime DEFAULT NULL,
  `config` json DEFAULT NULL,
  `status` enum('-1','0','1') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `activities`
--

LOCK TABLES `activities` WRITE;
/*!40000 ALTER TABLE `activities` DISABLE KEYS */;
INSERT INTO `activities` VALUES (1,'2020年DX7星跃上市及6-8月全系促销媒介投放（广企）-抖音','SEM202000500','留资，抽奖','2020-08-01 00:00:00','2020-08-31 00:00:00','{\"origin\": \"http://www.baidu.com\", \"referer\": \"1\", \"media_id\": \"07500000DY\", \"utm_medium\": \"douyin\", \"utm_source\": \"1\", \"utm_content\": \"douyin\", \"utm_campaign\": \"douyin\", \"mobile_verify\": \"0\"}','1','2020-08-01 15:00:00','2020-08-03 09:46:20');
/*!40000 ALTER TABLE `activities` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `admin_menu`
--

DROP TABLE IF EXISTS `admin_menu`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `admin_menu` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `parent_id` int NOT NULL DEFAULT '0',
  `order` int NOT NULL DEFAULT '0',
  `title` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `icon` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `uri` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `permission` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=18 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admin_menu`
--

LOCK TABLES `admin_menu` WRITE;
/*!40000 ALTER TABLE `admin_menu` DISABLE KEYS */;
INSERT INTO `admin_menu` VALUES (1,0,1,'控制台','fa-bar-chart','/',NULL,NULL,NULL),(2,0,8,'管理员','fa-tasks','',NULL,NULL,'2020-08-02 05:23:26'),(3,2,10,'管理员','fa-users','auth/users',NULL,NULL,'2020-08-02 05:23:26'),(4,2,11,'角色','fa-user','auth/roles',NULL,NULL,'2020-08-02 05:23:26'),(5,2,12,'权限','fa-ban','auth/permissions',NULL,NULL,'2020-08-02 05:23:26'),(6,2,13,'菜单','fa-bars','auth/menu',NULL,NULL,'2020-08-02 05:23:26'),(7,2,14,'操作日志','fa-history','auth/logs',NULL,NULL,'2020-08-02 05:23:26'),(8,0,2,'活动','fa-cubes',NULL,NULL,'2020-08-01 12:57:43','2020-08-01 13:39:43'),(9,8,3,'活动管理','fa-envira','/activities',NULL,'2020-08-01 13:03:15','2020-08-01 16:37:21'),(10,2,9,'任务列表','fa-book','/tasks',NULL,'2020-08-01 15:05:31','2020-08-02 05:23:26'),(11,0,4,'预约试驾','fa-calendar-check-o',NULL,NULL,'2020-08-01 16:37:16','2020-08-01 16:37:21'),(12,11,5,'经销商管理','fa-building-o','/dealers',NULL,'2020-08-01 16:38:22','2020-08-02 05:23:26'),(13,11,6,'预约试驾','fa-car','/drive-reservations',NULL,'2020-08-02 03:34:45','2020-08-02 05:23:26'),(14,0,7,'抽奖','fa-gift',NULL,NULL,'2020-08-02 05:23:18','2020-08-02 05:23:26'),(15,14,0,'奖品组','fa-object-group','/prize-groups',NULL,'2020-08-02 05:23:57','2020-08-02 05:23:57'),(16,14,0,'奖品管理','fa-gift','/prizes',NULL,'2020-08-02 05:46:31','2020-08-02 05:46:31'),(17,14,0,'中奖信息','fa-align-justify','/prize-logs',NULL,'2020-08-02 06:23:07','2020-08-02 06:23:07');
/*!40000 ALTER TABLE `admin_menu` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `admin_operation_log`
--

DROP TABLE IF EXISTS `admin_operation_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `admin_operation_log` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `path` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `method` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `ip` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `input` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `admin_operation_log_user_id_index` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=656 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admin_operation_log`
--

LOCK TABLES `admin_operation_log` WRITE;
/*!40000 ALTER TABLE `admin_operation_log` DISABLE KEYS */;

/*!40000 ALTER TABLE `admin_operation_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `admin_permissions`
--

DROP TABLE IF EXISTS `admin_permissions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `admin_permissions` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `http_method` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `http_path` text COLLATE utf8mb4_unicode_ci,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `admin_permissions_name_unique` (`name`),
  UNIQUE KEY `admin_permissions_slug_unique` (`slug`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admin_permissions`
--

LOCK TABLES `admin_permissions` WRITE;
/*!40000 ALTER TABLE `admin_permissions` DISABLE KEYS */;
INSERT INTO `admin_permissions` VALUES (1,'All permission','*','','*',NULL,NULL),(2,'Dashboard','dashboard','GET','/',NULL,NULL),(3,'Login','auth.login','','/auth/login\r\n/auth/logout',NULL,NULL),(4,'User setting','auth.setting','GET,PUT','/auth/setting',NULL,NULL),(5,'Auth management','auth.management','','/auth/roles\r\n/auth/permissions\r\n/auth/menu\r\n/auth/logs',NULL,NULL);
/*!40000 ALTER TABLE `admin_permissions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `admin_role_menu`
--

DROP TABLE IF EXISTS `admin_role_menu`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `admin_role_menu` (
  `role_id` int NOT NULL,
  `menu_id` int NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  KEY `admin_role_menu_role_id_menu_id_index` (`role_id`,`menu_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admin_role_menu`
--

LOCK TABLES `admin_role_menu` WRITE;
/*!40000 ALTER TABLE `admin_role_menu` DISABLE KEYS */;
INSERT INTO `admin_role_menu` VALUES (1,2,NULL,NULL);
/*!40000 ALTER TABLE `admin_role_menu` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `admin_role_permissions`
--

DROP TABLE IF EXISTS `admin_role_permissions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `admin_role_permissions` (
  `role_id` int NOT NULL,
  `permission_id` int NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  KEY `admin_role_permissions_role_id_permission_id_index` (`role_id`,`permission_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admin_role_permissions`
--

LOCK TABLES `admin_role_permissions` WRITE;
/*!40000 ALTER TABLE `admin_role_permissions` DISABLE KEYS */;
INSERT INTO `admin_role_permissions` VALUES (1,1,NULL,NULL);
/*!40000 ALTER TABLE `admin_role_permissions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `admin_role_users`
--

DROP TABLE IF EXISTS `admin_role_users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `admin_role_users` (
  `role_id` int NOT NULL,
  `user_id` int NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  KEY `admin_role_users_role_id_user_id_index` (`role_id`,`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admin_role_users`
--

LOCK TABLES `admin_role_users` WRITE;
/*!40000 ALTER TABLE `admin_role_users` DISABLE KEYS */;
INSERT INTO `admin_role_users` VALUES (1,1,NULL,NULL);
/*!40000 ALTER TABLE `admin_role_users` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `admin_roles`
--

DROP TABLE IF EXISTS `admin_roles`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `admin_roles` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `admin_roles_name_unique` (`name`),
  UNIQUE KEY `admin_roles_slug_unique` (`slug`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admin_roles`
--

LOCK TABLES `admin_roles` WRITE;
/*!40000 ALTER TABLE `admin_roles` DISABLE KEYS */;
INSERT INTO `admin_roles` VALUES (1,'Administrator','administrator','2020-07-31 10:19:59','2020-07-31 10:19:59');
/*!40000 ALTER TABLE `admin_roles` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `admin_user_permissions`
--

DROP TABLE IF EXISTS `admin_user_permissions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `admin_user_permissions` (
  `user_id` int NOT NULL,
  `permission_id` int NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  KEY `admin_user_permissions_user_id_permission_id_index` (`user_id`,`permission_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admin_user_permissions`
--

LOCK TABLES `admin_user_permissions` WRITE;
/*!40000 ALTER TABLE `admin_user_permissions` DISABLE KEYS */;
/*!40000 ALTER TABLE `admin_user_permissions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `admin_users`
--

DROP TABLE IF EXISTS `admin_users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `admin_users` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `username` varchar(190) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(60) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `avatar` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `admin_users_username_unique` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admin_users`
--

LOCK TABLES `admin_users` WRITE;
/*!40000 ALTER TABLE `admin_users` DISABLE KEYS */;
INSERT INTO `admin_users` VALUES (1,'admin','$2y$10$O/YYPLC.Ded8o62Fp.S4cuMYVJ.87k5kEw71Ah0fJeWftbiCDyoQe','超级管理员',NULL,'XX6oxUYorncl9x4T1LowCqYksgRuL1MWyQ8NmXqK2UpkcStoBKvD8xBSAzLk','2020-07-31 10:19:59','2020-08-03 09:37:20');
/*!40000 ALTER TABLE `admin_users` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `dealers`
--

DROP TABLE IF EXISTS `dealers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `dealers` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `province` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL,
  `city` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL,
  `code` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL,
  `simplify` varchar(128) COLLATE utf8mb4_unicode_ci NOT NULL,
  `type` enum('','sales') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `tel` varchar(32) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `supports` varchar(128) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `status` enum('-1','0','1') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `addr` varbinary(128) DEFAULT '',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=208 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `dealers`
--

LOCK TABLES `dealers` WRITE;
/*!40000 ALTER TABLE `dealers` DISABLE KEYS */;
INSERT INTO `dealers` VALUES (1,'上海市','上海市','AD0302','沪南销售服务店','沪南销售服务店','','021-68041088','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(2,'上海市','上海市','AD0309','闵行区销售服务店','闵行区销售服务店','','021-64785050','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(3,'云南省','丽江市','AW0201','古城区销售服务店','古城区销售服务店','','18908880918','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(4,'云南省','大理白族自治州','AH8901','泛亚汽车城销售服务店','泛亚汽车城销售服务店','','0872-2332668','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(5,'云南省','文山壮族苗族自治州','AH9101','开化镇销售服务店','开化镇销售服务店','','0876-2135658','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(6,'云南省','曲靖市','AH3601','紫云路销售服务店','紫云路销售服务店','','0874-3514377','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(7,'内蒙古','乌兰察布市','AQ2201','工业大道销售服务店','工业大道销售服务店','','0474-3607111','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(8,'内蒙古','乌海市','AQ1201','海达西街销售服务店','海达西街销售服务店','','0473-2087555','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(9,'内蒙古','包头市','AQ2301','海丰汽贸院销售服务店','海丰汽贸院销售服务店','','18604733777','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(10,'内蒙古','呼伦贝尔市','AQ2601','鄂温克族销售服务店','鄂温克族销售服务店','','18947576885','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(11,'内蒙古','赤峰市','AQ2501','红山区金都街销售服务店','红山区金都街销售服务店','','0476-8886444','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(12,'内蒙古','鄂尔多斯市','AQ2101','东胜区销售服务店','东胜区销售服务店','','0477-8114911','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(13,'内蒙古','锡林郭勒盟','AQ1301','民禾物流园销售服务店','民禾物流园销售服务店','','0479-6837766','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(14,'北京市','北京市','AP0605','亦庄销售服务店','亦庄销售服务店','','010-67886143','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(15,'北京市','北京市','AP3001','密云销售服务店','密云销售服务店','','010-89097755','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(16,'北京市','北京市','AP2201','房山销售服务店','房山销售服务店','','010-81306678','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(17,'北京市','北京市','AP2902','朝阳销售服务店','朝阳销售服务店','','010-65703165','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(18,'北京市','北京市','AP2301','西三旗桥销售服务店','西三旗桥销售服务店','','010-62076939','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(19,'北京市','北京市','AP3003','顺义销售服务店','顺义销售服务店','','010-80491988','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(20,'吉林省','四平市','AZ0704','铁东开发区销售服务店','铁东开发区销售服务店','','0434-7771888','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(21,'吉林省','长春市','AZ1001','普阳街销售服务店','普阳街销售服务店','','0431-82919998','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(22,'四川省','南充市','AH9001','高坪区销售服务店','高坪区销售服务店','','0817-5230999','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(23,'四川省','宜宾市','AW1101','翠屏区销售服务店','翠屏区销售服务店','','0831-8211177','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(24,'四川省','巴中市','AH4802','巴州区销售服务店','巴州区销售服务店','','0827-8588000','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(25,'四川省','德阳市','AW1301','北外乡销售服务店','北外乡销售服务店','','0838-5288199','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(26,'四川省','成都市','AW1201','成华区销售服务店','成华区销售服务店','','15982164601','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(27,'四川省','成都市','AW1501','灌温路销售服务店','灌温路销售服务店','','028-89747775','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(28,'四川省','眉山市','AH2901','铁环路销售服务店','铁环路销售服务店','','028-38176008','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(29,'四川省','达州市','BA0101','中青路销售服务店','中青路销售服务店','','0818-3682999','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(30,'四川省','遂宁市','AH6802','东风汽车城销售服务店','东风汽车城销售服务店','','0825-2620928','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(31,'天津市','天津市','AN0401','宝坻区汽车城销售服务店','宝坻区汽车城销售服务店','','022-29992891','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(32,'天津市','天津市','AN0402','宝坻区钰华街销售店','宝坻区钰华街销售店','','022-29222891','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(33,'天津市','天津市','AN0602','新宜白大道销售店','新宜白大道销售店','','022-26307779','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(34,'天津市','天津市','AN0604','武清区知业道销售店','武清区知业道销售店','','022-22161909','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(35,'天津市','天津市','AN0601','王兰庄汽车市场销售服务店','王兰庄汽车市场销售服务店','','022-58898589','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(36,'天津市','天津市','AN0403','蓟州销售服务店','蓟州销售服务店','','022-82722891','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(37,'宁夏省','固原市','CY0101','原州区创业店','原州区创业店','','18152446616','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(38,'安徽省','合肥市','AA8501','蒙城北路销售服务店','蒙城北路销售服务店','','0551-66777128','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(39,'安徽省','阜阳市','AA6301','颍州区销售服务店','颍州区销售服务店','','0558-2227555','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(40,'山东省','临沂市','AF6801','兰山区销售服务店','兰山区销售服务店','','0539-8029997','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(41,'山东省','威海市','AF1804','冶口销售服务店','冶口销售服务店','','0631-5903330','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(42,'山东省','威海市','AF1807','鑫通汽车城销售服务店','鑫通汽车城销售服务店','','0631-7588330','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(43,'山东省','德州市','AF6001','亚飞车城销售服务店','亚飞车城销售服务店','','0534-2212133','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(44,'山东省','日照市','AF2401','奎山销售服务店','奎山销售服务店','','0633-8612345','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(45,'山东省','枣庄市','AF0303','山亭区销售服务店','山亭区销售服务店','','0632-5889520','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(46,'山东省','枣庄市','AF0301','平行路销售服务店','平行路销售服务店','','0632-5889520','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(47,'山东省','泰安市','AF6901','岱岳区销售服务店','岱岳区销售服务店','','0538-5778888','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(48,'山东省','济南市','AF2201','匡山销售服务店','匡山销售服务店','','0531-55595559','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(49,'山东省','济宁市','AF7101','任城区销售服务店','任城区销售服务店','','0537-2773030','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(50,'山东省','滨州市','AF6601','滨城区销售服务店','滨城区销售服务店','','0543-5080397','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(51,'山东省','潍坊市','AF6501','奎文区潍州路销售服务店','奎文区潍州路销售服务店','','0536-8800090','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(52,'山东省','烟台市','AF5101','芝罘区销售服务店','芝罘区销售服务店','','0535-3393339','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(53,'山东省','聊城市','AF2901','建设路销售服务店','建设路销售服务店','','0635-8315889','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(54,'山东省','菏泽市','AF5801','市辖区黄河路销售服务店','市辖区黄河路销售服务店','','0530-6227666','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(55,'山东省','菏泽市','AF7201','牡丹区黄河东路销售服务店','牡丹区黄河东路销售服务店','','15964697345','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(56,'山东省','青岛市','AF5401','兰州东路销售服务店','兰州东路销售服务店','','0532-81120618','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(57,'山东省','青岛市','AF6701','城阳区销售服务店','城阳区销售服务店','','0532-84898888','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(58,'山东省','青岛市','AF7001','平度柳州路销售服务店','平度柳州路销售服务店','','0532-80817889','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(59,'山东省','青岛市','AF3201','泰山路销售服务店','泰山路销售服务店','','0532-82124999','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(60,'山西省','临汾市','AP3701','尧都区销售服务店','尧都区销售服务店','','0357-3980333','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(61,'山西省','大同市','AP3601','庞大汽贸园销售服务店','庞大汽贸园销售服务店','','0352-2890888','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(62,'山西省','太原市','AP4101','太原汇众销售服务店','太原汇众销售服务店','','0351-2206663','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(63,'山西省','晋城市','AP2501','城区销售服务店','城区销售服务店','','0356-8881098','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(64,'山西省','运城市','AP4301','空港新区销售服务店','空港新区销售服务店','','18635950517','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(65,'山西省','长治市','AP3102','北外环路销售服务店','北外环路销售服务店','','0355-8583322','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(66,'广东省','东莞市','AB2008','寮步销售服务店','寮步销售服务店','','0769-89296130','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(67,'广东省','东莞市','AB2009','常平销售（服务）店','常平销售（服务）店','','0769-38953130','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(68,'广东省','中山市','AB6101','东升镇销售服务店','东升镇销售服务店','','0760-22221555','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(69,'广东省','中山市','AB6103','火炬开发区销售服务店','火炬开发区销售服务店','','0760-22220009','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(70,'广东省','云浮市','AB7101','云城区销售服务店','云城区销售服务店','','0766-8337188','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(71,'广东省','佛山市','AB4301','海八路销售服务店','海八路销售服务店','','0757-86255088','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(72,'广东省','佛山市','AB4304','高明车城销售店','高明车城销售店','','0757-81231681','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(73,'广东省','广州市','AB7301','白云区销售服务店','白云区销售服务店','','13729825622','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(74,'广东省','广州市','AB6501','花都销售服务店','花都销售服务店','','020-61808666','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(75,'广东省','揭阳市','AB6201','揭阳销售服务店','揭阳销售服务店','','0663-3987888','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(76,'广东省','汕头市','AB6202','汕头销售（服务）店','汕头销售（服务）店','','0754-87221277','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(77,'广东省','清远市','AB6301','广清大道销售服务店','广清大道销售服务店','','0763-6975332','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(78,'广东省','潮州市','AB6203','潮州枫溪区销售店','潮州枫溪区销售店','','0768-5222233','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(79,'广东省','珠海市','AB2701','珠光车城销售服务店','珠光车城销售服务店','','0756-8699512','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(80,'广东省','茂名市','AB3301','亿泰销售服务店','亿泰销售服务店','','0668-2917696','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(81,'广东省','韶关市','AB7201','浈江区销售服务店','浈江区销售服务店','','0751-8220030','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(82,'广西省','南宁市','AM1501','昆仑大道销售服务店','昆仑大道销售服务店','','0771-3389027','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(83,'广西省','柳州市','AM0301','广汽路销售服务店','广汽路销售服务店','','0772-8803858','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(84,'广西省','桂林市','AM1601','秀峰区销售服务店','秀峰区销售服务店','','0773-5810788','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(85,'江苏省','南京市','AK4301','六合销售服务店','六合销售服务店','','15720802691','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(86,'江苏省','南通市','AK4601','长江北路销售服务店','长江北路销售服务店','','0513-85663030','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(87,'江苏省','无锡市','CY0301','融达汽车城创业店','融达汽车城创业店','','0510-87229991','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(88,'江苏省','淮安市','AK2402','淮阴销售服务店','淮阴销售服务店','','0517-83717788','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(89,'江苏省','盐城市','AK1401','盐都区销售服务店','盐都区销售服务店','','0515-89900766','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(90,'江苏省','苏州市','AK4701','吴江梅堰镇销售服务店','吴江梅堰镇销售服务店','','0512-63689999','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(91,'江苏省','苏州市','AK3902','昆山销售服务店','昆山销售服务店','','0512-57720066','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(92,'江苏省','苏州市','AK3901','高新车城销售服务店','高新车城销售服务店','','0512-66063030','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(93,'江苏省','镇江市','AK1601','京口区纬三路销售服务店','京口区纬三路销售服务店','','0511-88882000','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(94,'江西省','九江市','AA7001','九瑞路销售服务店','九瑞路销售服务店','','0792-8370768','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(95,'江西省','吉安市','AA7601','合丰汽车城销售服务店','合丰汽车城销售服务店','','0796-8737766','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(96,'江西省','宜春市','AA6801','袁州区销售服务店','袁州区销售服务店','','0795-3230066','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(97,'江西省','抚州市','AA7603','抚州赣东国际汽车城销售服务店','抚州赣东国际汽车城销售服务店','','0794-8200598','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(98,'江西省','新余市','AA7602','新余销售(服务)店','新余销售(服务)店','','0796-8737766','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(99,'河北省','保定市','AR0302','世纪车城销售服务店','世纪车城销售服务店','','0312-5939090','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(100,'河北省','保定市','AR2001','南二环销售服务店','南二环销售服务店','','0312-8910801','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(101,'河北省','保定市','AR2002','定州销售服务店','定州销售服务店','','0312-2321199','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(102,'河北省','保定市','AR2401','清苑区销售服务店','清苑区销售服务店','','13931236365','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(103,'河北省','唐山市','AR2301','西外环销售服务店','西外环销售服务店','','0315-2730631','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(104,'河北省','廊坊市','AR0316','廊坊市三河市销售店','廊坊市三河市销售店','','','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(105,'河北省','廊坊市','AR0303','解放大道销售服务店','解放大道销售服务店','','0316-5903311','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(106,'河北省','张家口市','AR1301','张宣公路销售服务店','张宣公路销售服务店','','0313-4086661','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(107,'河北省','承德市','AR1901','双滦销售服务店','双滦销售服务店','','0314-2525522','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(108,'河北省','沧州市','AR0701','石港路销售服务店','石港路销售服务店','','0317-3565980','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(109,'河北省','石家庄市','AR0201','北二环销售服务店','北二环销售服务店','','0311-86859777','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(110,'河北省','秦皇岛市','AR2304','秦皇岛海港区销售服务店','秦皇岛海港区销售服务店','','0335-3646188','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(111,'河北省','衡水市','AR2501','桃城区销售服务店','桃城区销售服务店','','0318-2157777','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(112,'河北省','邢台市','AR0504','任县销售服务店','任县销售服务店','','0319-5031666','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(113,'河北省','邢台市','AR2201','龙岗大街销售服务店','龙岗大街销售服务店','','0319-3210123','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(114,'河北省','邯郸市','AR0401','联纺西路销售店','联纺西路销售店','','0310-5515050','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(115,'河北省','邯郸市','AR0405','荣汇车城销售服务店','荣汇车城销售服务店','','0310-5100019','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(116,'河南省','三门峡市','AS5301','渑池县销售服务店','渑池县销售服务店','','13333985957','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(117,'河南省','信阳市','AS4701','羊山新区销售服务店','羊山新区销售服务店','','0376-3809790','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(118,'河南省','南阳市','AS3901','信臣路销售服务店','信臣路销售服务店','','0377-66018777','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(119,'河南省','南阳市','AS3903','邓州销售（服务）店','邓州销售（服务）店','','0377-62668688','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(120,'河南省','周口市','AS5201','市辖区新能源汽车城销售服务店','市辖区新能源汽车城销售服务店','','13271681199','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(121,'河南省','商丘市','AS5601','梁园区销售服务店','梁园区销售服务店','','0370-2852198','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(122,'河南省','商丘市','AS1202','车城大道销售服务店','车城大道销售服务店','','0370-2227000','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(123,'河南省','安阳市','AS4201','文峰区销售服务店','文峰区销售服务店','','0372-2103111','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(124,'河南省','新乡市','AS5401','卫滨区销售服务店','卫滨区销售服务店','','18238771777','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(125,'河南省','洛阳市','AS5101','洛龙区文仲大道销售服务店','洛龙区文仲大道销售服务店','','0379-60633111','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(126,'河南省','济源市','AS2403','济源销售店','济源销售店','','','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(127,'河南省','濮阳市','AS0701','瑞璞汽车小镇销售服务店','瑞璞汽车小镇销售服务店','','0393-8809777','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(128,'河南省','焦作市','AS2402','宏达名车城销售店','宏达名车城销售店','','0391-8335159','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(129,'河南省','焦作市','AS2401','富源车城销售服务店','富源车城销售服务店','','0391-8335159','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(130,'河南省','许昌市','AS4801','万通汽贸城销售服务店','万通汽贸城销售服务店','','0374-3368888','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(131,'河南省','郑州市','AS3401','郑东新区销售服务店','郑东新区销售服务店','','0371-68898888','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(132,'河南省','郑州市','AS5501','金水区销售服务店','金水区销售服务店','','0371-66663939','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(133,'河南省','驻马店市','AS4301','神州汽配城销售服务店','神州汽配城销售服务店','','0396-3331800','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(134,'河南省','鹤壁市','AS2801','天择车城销售服务店','天择车城销售服务店','','0392-2219939','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(135,'浙江省','台州市','AC0109','台州销售服务店','台州销售服务店','','0576-82698555','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(136,'浙江省','嘉兴市','AC0111','嘉兴销售服务店','嘉兴销售服务店','','0573-82697600','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(137,'浙江省','嘉兴市','AC0112','桐乡销售服务店','桐乡销售服务店','','0573-88053030','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(138,'浙江省','宁波市','AC0401','北仑区销售服务店','北仑区销售服务店','','','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(139,'浙江省','宁波市','AC0119','宁波慈溪销售店','宁波慈溪销售店','','0574-63235666','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(140,'浙江省','宁波市','AC0105','宁波销售服务店','宁波销售服务店','','0574-88211999','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(141,'浙江省','杭州市','AC0102','杭州城东销售服务店','杭州城东销售服务店','','0571-86016200','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(142,'浙江省','杭州市','AC0101','杭州城北销售服务店','杭州城北销售服务店','','0571-88013033','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(143,'浙江省','杭州市','AC0114','萧山销售（服务）店','萧山销售（服务）店','','0571-83873030','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(144,'浙江省','温州市','AC0301','温州大道销售服务店','温州大道销售服务店','','13429284446','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(145,'浙江省','温州市','AC0106','温州销售服务店','温州销售服务店','','0577-89993030','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(146,'浙江省','湖州市','AC0113','湖州销售服务店','湖州销售服务店','','0572-2166188','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(147,'浙江省','绍兴市','AC0141','嵊州销售服务店','嵊州销售服务店','','0575-83303030','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(148,'浙江省','绍兴市','AC0136','诸暨销售服务店','诸暨销售服务店','','0575-89093030','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(149,'浙江省','绍兴市','AC0138','越州销售服务店','越州销售服务店','','0575-88223030','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(150,'浙江省','衢州市','AC0139','衢州销售服务店','衢州销售服务店','','0570-3633030','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(151,'浙江省','金华市','AC0108','义乌销售服务店','义乌销售服务店','','0579-85993030','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(152,'海南省','海口市','AE0401','高新汽车广场销售服务店','高新汽车广场销售服务店','','0898-31929888','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(153,'湖北省','宜昌市','AT0401','东山销售服务店','东山销售服务店','','0717-6330011','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(154,'湖北省','武汉市','AT2801','汉阳大道销售服务店','汉阳大道销售服务店','','027-84766708','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(155,'湖北省','荆州市','AT3101','松滋销售服务店','松滋销售服务店','','0716-6113697','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(156,'湖北省','随州市','AT1403','金华车城销售服务店','金华车城销售服务店','','0722-3586788','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(157,'湖南省','常德市','AH4101','常德大道销售服务店','常德大道销售服务店','','0736-7817799','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(158,'湖南省','张家界市','AH6501','零阳销售服务店','零阳销售服务店','','0744-3252398','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(159,'湖南省','怀化市','AI1701','南环路销售服务店','南环路销售服务店','','0745-2299666','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(160,'湖南省','永州市','AH9401','冷水滩区销售服务店','冷水滩区销售服务店','','0746-8538777','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(161,'湖南省','长沙市','AH013101','星沙销售服务店','星沙销售服务店','','0731-82872666','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(162,'甘肃省','兰州市','AY0504','南山路销售服务店','南山路销售服务店','','0931-2122622','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(163,'甘肃省','嘉峪关市','AY0505','嘉峪关销售服务店','嘉峪关销售服务店','','0937-2688478','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(164,'甘肃省','武威市','AY1302','武威凉州区销售服务店','武威凉州区销售服务店','','19109352299','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(165,'甘肃省','酒泉市','CY0401','肃州区创业店','肃州区创业店','','0937-2688487','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(166,'甘肃省','陇南市','AY1301','武都区销售服务店','武都区销售服务店','','13919344426','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(167,'福建省','三明市','AA6101','德安路销售服务店','德安路销售服务店','','0598-8699888','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(168,'福建省','厦门市','AA8701','海沧区销售服务店','海沧区销售服务店','','0592-7701078','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(169,'福建省','宁德市','AA0103','宁德蕉城销售服务店','宁德蕉城销售服务店','','0593-2721566','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(170,'福建省','泉州市','AA0506','晋江销售（服务）店','晋江销售（服务）店','','0595-88192998','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(171,'福建省','泉州市','AA0501','清濛销售服务店','清濛销售服务店','','0595-22355230','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(172,'福建省','泉州市','AA0503','石狮销售店','石狮销售店','','0595-88552998','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(173,'福建省','漳州市','AA6201','龙文北路销售服务店','龙文北路销售服务店','','0596-2113030','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(174,'福建省','福州市','AA0101','华夏销售服务店','华夏销售服务店','','0591-83402745','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(175,'福建省','福州市','AA8801','闽侯销售服务店','闽侯销售服务店','','13328668848','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(176,'福建省','福州市','AA8802','齐安路销售服务店','齐安路销售服务店','','13328668848','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(177,'福建省','莆田市','AA4501','城涵大道销售服务店','城涵大道销售服务店','','0594-2755133','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(178,'福建省','龙岩市','AA8601','新罗区销售服务店','新罗区销售服务店','','0597-5306298','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(179,'西藏','拉萨市','AH6202','堆龙德庆区销售服务店','堆龙德庆区销售服务店','','0891-6818111','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(180,'贵州省','六盘水市','AW1601','凉都大道销售服务店','凉都大道销售服务店','','0858-8961508','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(181,'贵州省','安顺市','AH5601','货场路销售服务店','货场路销售服务店','','0851-33517218','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(182,'贵州省','毕节市','AW1001','七星关区销售服务店','七星关区销售服务店','','0857-8228366','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(183,'贵州省','贵阳市','AW080101','花溪孟关汽车销售服务店','花溪孟关汽车销售服务店','','0851-83712600','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(184,'贵州省','遵义市','AH6301','播州区销售服务店','播州区销售服务店','','0851-28208022','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(185,'贵州省','遵义市','AI2101','黔北汽车城销售服务店','黔北汽车城销售服务店','','0851-28208022','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(186,'贵州省','铜仁市','AW0402','碧江区武陵山汽车城销售服务店','碧江区武陵山汽车城销售服务店','','0856-6925777','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(187,'贵州省','黔东南苗族侗族自治州','AH5701','经纬国际汽车城销售服务店','经纬国际汽车城销售服务店','','0855-2292888','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(188,'辽宁省','大连市','AJ0402','华东路东南销售服务店','华东路东南销售服务店','','0411-86860922','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(189,'辽宁省','朝阳市','AJ2601','双塔区销售服务店','双塔区销售服务店','','0421-2517777','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(190,'辽宁省','沈阳市','AJ0406','沈阳和平区销售服务店','沈阳和平区销售服务店','','024-23400138','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(191,'辽宁省','盘锦市','AJ0405','盘锦销售服务店','盘锦销售服务店','','0349-2090088','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(192,'辽宁省','营口市','AJ2701','鲅鱼圈区销售服务店','鲅鱼圈区销售服务店','','0417-8208777','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(193,'辽宁省','锦州市','CY0201','太和区创业店','太和区创业店','','15804923335','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(194,'辽宁省','阜新市','CY0501','细河区创业店','细河区创业店','','0418-2801666','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(195,'辽宁省','鞍山市','AJ2801','千山销售服务店','千山销售服务店','','0412-5812358','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(196,'重庆市','重庆市','AH6403','九龙坡区销售服务店','九龙坡区销售服务店','','023-62887878','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(197,'陕西省','咸阳市','AI2001','秦汉新城销售服务店','秦汉新城销售服务店','','029-33126789','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(198,'陕西省','宝鸡市','AI1801','陈仓区阳平镇销售店','陈仓区阳平镇销售店','','0917-6750000','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(199,'陕西省','宝鸡市','AI1802','高新路销售服务店','高新路销售服务店','','0917-6750000','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(200,'陕西省','汉中市','AI1102','经开区销售服务店','经开区销售服务店','','0916-2318680','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(201,'陕西省','汉中市','AI1101','贾旗路销售服务店','贾旗路销售服务店','','0916-3228333','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(202,'陕西省','渭南市','AI1201','澄城韦庄销售服务店','澄城韦庄销售服务店','','0913-6821352','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(203,'陕西省','西安市','AI1901','未央区西部车城销售服务店','未央区西部车城销售服务店','','029-84530461','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(204,'黑龙江','哈尔滨市','AO2201','道外区先锋路销售服务店','道外区先锋路销售服务店','','0451-55571855','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(205,'黑龙江','哈尔滨市','AO2301','道里区销售服务店','道里区销售服务店','','0451-89966666','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(206,'黑龙江','大庆市','AO1601','庆新大街销售服务店','庆新大街销售服务店','','0459-6282229','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL),(207,'黑龙江','绥化市','AO1901','宝山路销售服务店','宝山路销售服务店','','0455-8296999','','1','2020-08-01 17:48:03','2020-08-01 17:48:03',NULL);
/*!40000 ALTER TABLE `dealers` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `drive_reservations`
--

DROP TABLE IF EXISTS `drive_reservations`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `drive_reservations` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `source` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'default',
  `mobile` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `activity_id` int NOT NULL DEFAULT '0',
  `gender` enum('0','1','2') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '0',
  `province` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL,
  `city` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL,
  `car` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT '',
  `dealer_code` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL,
  `dealer` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL,
  `media` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `ip` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '0.0.0.0',
  `crm_sync` enum('0','1') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '0',
  `sync_status` enum('-1','0','1') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '0',
  `ordertime` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `buytime` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `status` enum('-1','0','1') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `drive_reservations`
--

LOCK TABLES `drive_reservations` WRITE;
/*!40000 ALTER TABLE `drive_reservations` DISABLE KEYS */;
/*!40000 ALTER TABLE `drive_reservations` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `failed_jobs`
--

DROP TABLE IF EXISTS `failed_jobs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `failed_jobs` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `failed_jobs`
--

LOCK TABLES `failed_jobs` WRITE;
/*!40000 ALTER TABLE `failed_jobs` DISABLE KEYS */;
/*!40000 ALTER TABLE `failed_jobs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `medias`
--

DROP TABLE IF EXISTS `medias`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `medias` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL,
  `code` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL,
  `ext_info` json DEFAULT NULL,
  `status` enum('-1','0','1') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `medias`
--

LOCK TABLES `medias` WRITE;
/*!40000 ALTER TABLE `medias` DISABLE KEYS */;
/*!40000 ALTER TABLE `medias` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `migrations`
--

DROP TABLE IF EXISTS `migrations`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `migrations` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=18 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `migrations`
--

LOCK TABLES `migrations` WRITE;
/*!40000 ALTER TABLE `migrations` DISABLE KEYS */;
INSERT INTO `migrations` VALUES (3,'2016_01_04_173148_create_admin_tables',1),(4,'2019_08_19_000000_create_failed_jobs_table',1),(9,'2020_08_01_192719_create_activities_table',2),(10,'2020_08_01_214935_create_dealers_table',2),(11,'2020_08_01_230104_create_tasks_table',3),(12,'2020_08_01_230736_create_prize_groups_table',4),(13,'2020_08_01_230745_create_prizes_table',4),(14,'2020_08_01_230753_create_prize_logs_table',4),(15,'2020_08_02_000819_create_drive_reservations_table',4),(16,'2020_08_02_002957_create_medias_table',5),(17,'2020_08_02_195936_create_prize_tickets_table',6);
/*!40000 ALTER TABLE `migrations` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `prize_groups`
--

DROP TABLE IF EXISTS `prize_groups`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `prize_groups` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `activity_id` int NOT NULL DEFAULT '0',
  `name` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL,
  `bz` varchar(256) COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_limit_mode` enum('no','once_per_group','once_per_activity') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'once_per_group',
  `config` json DEFAULT NULL,
  `status` enum('-1','0','1') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `prize_groups`
--

LOCK TABLES `prize_groups` WRITE;
/*!40000 ALTER TABLE `prize_groups` DISABLE KEYS */;
/*!40000 ALTER TABLE `prize_groups` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `prize_logs`
--

DROP TABLE IF EXISTS `prize_logs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `prize_logs` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `activity_id` int NOT NULL DEFAULT '0',
  `group_id` int NOT NULL DEFAULT '0',
  `prize_id` int NOT NULL DEFAULT '0',
  `source_type` enum('drive_reservation','') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `source_id` int NOT NULL DEFAULT '0',
  `code` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '0',
  `ip` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '0.0.0.0',
  `status` enum('-1','0','1') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '1',
  `ext_info` json DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `mobile` varchar(32) COLLATE utf8mb4_unicode_ci DEFAULT '',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `prize_logs`
--

LOCK TABLES `prize_logs` WRITE;
/*!40000 ALTER TABLE `prize_logs` DISABLE KEYS */;
/*!40000 ALTER TABLE `prize_logs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `prize_tickets`
--

DROP TABLE IF EXISTS `prize_tickets`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `prize_tickets` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `prize_id` int NOT NULL DEFAULT '0',
  `ticket` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `in_pool` enum('0','1') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '0',
  `status` enum('-1','0','1') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `prize_tickets`
--

LOCK TABLES `prize_tickets` WRITE;
/*!40000 ALTER TABLE `prize_tickets` DISABLE KEYS */;
/*!40000 ALTER TABLE `prize_tickets` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `prizes`
--

DROP TABLE IF EXISTS `prizes`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `prizes` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `group_id` int NOT NULL DEFAULT '0',
  `name` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL,
  `bz` varchar(256) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `type` enum('physical','coupon','virtual') COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` varchar(128) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `total` int NOT NULL DEFAULT '0',
  `stock` int NOT NULL DEFAULT '0',
  `probability` int NOT NULL DEFAULT '0',
  `is_default` enum('0','1') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '0',
  `date_limit` json DEFAULT NULL,
  `config` json DEFAULT NULL,
  `sort` int NOT NULL DEFAULT '0',
  `leave_info` enum('0','1') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '0',
  `status` enum('-1','0','1') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `prizes`
--

LOCK TABLES `prizes` WRITE;
/*!40000 ALTER TABLE `prizes` DISABLE KEYS */;
/*!40000 ALTER TABLE `prizes` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tasks`
--

DROP TABLE IF EXISTS `tasks`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tasks` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `operator_id` int NOT NULL DEFAULT '0',
  `type` varchar(32) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `name` varchar(32) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `memo` varchar(128) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `params` json DEFAULT NULL,
  `result` text COLLATE utf8mb4_unicode_ci,
  `status` enum('-1','0','1','2','3') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tasks`
--

LOCK TABLES `tasks` WRITE;
/*!40000 ALTER TABLE `tasks` DISABLE KEYS */;
/*!40000 ALTER TABLE `tasks` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-08-03 19:39:15
